package me.manuloff.lib.table.renderer.style.border;

/**
 * Стиль линии рамки (аналог CSS border-style).
 *
 * @author Manuloff
 * @since 2.0
 */
public enum BorderStyle {
    /**
     * Нет рамки. При схлопывании рамок уступает любому другому стилю.
     */
    NONE,
    /**
     * Нет рамки. При схлопывании рамок подавляет все конкурирующие рамки.
     */
    HIDDEN,
    /**
     * Круглые точки.
     */
    DOTTED,
    /**
     * Штрихи.
     */
    DASHED,
    /**
     * Сплошная линия.
     */
    SOLID,
    /**
     * Две параллельные линии.
     */
    DOUBLE,
    /**
     * Вдавленная канавка.
     */
    GROOVE,
    /**
     * Выпуклый гребень.
     */
    RIDGE,
    /**
     * Блок выглядит вдавленным.
     */
    INSET,
    /**
     * Блок выглядит выпуклым.
     */
    OUTSET
}
