package me.manuloff.lib.table.renderer.style.text;

/**
 * Обработка пробелов и переносов строк (аналог CSS white-space).
 *
 * @author Manuloff
 * @since 2.0
 */
public enum WhiteSpace {
    /**
     * Пробелы схлопываются, текст переносится.
     */
    NORMAL,
    /**
     * Пробелы схлопываются, текст не переносится.
     */
    NOWRAP,
    /**
     * Пробелы и переводы строк сохраняются, текст не переносится.
     */
    PRE,
    /**
     * Пробелы и переводы строк сохраняются, текст переносится.
     */
    PRE_WRAP,
    /**
     * Пробелы схлопываются, переводы строк сохраняются, текст переносится.
     */
    PRE_LINE
}
